In [1]:
import numpy as np
import pandas as pd

In [2]:
#Let's first read the data
df = pd.read_csv('ds_salaries.csv')

#Seeing the head of the data
df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [4]:
#Let's see the shape of the data
df.shape

(607, 12)

In [5]:
#Let's see the describtion of the data
df.describe().T
#This will return for the numeric only

       Unnamed: 0    work_year        salary  salary_in_usd  remote_ratio
count  607.000000   607.000000  6.070000e+02     607.000000     607.00000
mean   303.000000  2021.405272  3.240001e+05  112297.869852      70.92257
std    175.370085     0.692133  1.544357e+06   70957.259411      40.70913
min      0.000000  2020.000000  4.000000e+03    2859.000000       0.00000
25%    151.500000  2021.000000  7.000000e+04   62726.000000      50.00000
50%    303.000000  2022.000000  1.150000e+05  101570.000000     100.00000
75%    454.500000  2022.000000  1.650000e+05  150000.000000     100.00000
max    606.000000  2022.000000  3.040000e+07  600000.000000     100.00000

In [6]:
#Let's see the info of the data 
df.info()
#We can see that, we have int64(5), object(7)
#And our data is about 607 rows and 12 col

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

In [8]:
#Let's check for the duplicated data
df.duplicated().sum()
#As we can see, we do not have duplicated data

0

In [9]:
#Let's check for the null data
df.isna().sum()
#Also, we do not have null data

Unnamed: 0            0
work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [10]:
#Let's see the columns
df.columns
#As we can see, there is a col name 'Unnamed: 0', which is not know for anything, so I am going to drop it

Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

In [11]:
#Let's drop the col 'Unnamed: 0'
df.drop('Unnamed: 0', axis=1, inplace=True)

In [12]:
#Let's see the head again of the data
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [13]:
#Let's see the max salary
df['salary'].max()
#As we can see, the max salary is 30400000

30400000

In [15]:
print(f'Max salary is: {df["salary"].max()}')

Max salary is: 30400000

In [16]:
#Let's see the min salary as well
print(f'Min salary is: {df["salary"].min()}')

Min salary is: 4000

### How takes the highest salary?

In [32]:
highest_job = df.groupby('job_title')['salary'].mean()
print(f"The highest job salary is: {highest_job.idxmax()}, and they take about {highest_job.max()}")

The highest job salary is: Head of Machine Learning, and they take about 6000000.0

In [33]:
highest_job = df.groupby(['job_title','company_location'])['salary'].mean()
print(f"The highest job salary is: {highest_job.idxmax()}, and they take about {highest_job.max()}")

The highest job salary is: ('Data Scientist', 'CL'), and they take about 30400000.0